[
  {
    "id": "1666179062793",
    "title": "Arsenal Women: The Gunners' Champions League meeting with Lyon will be a 'reality check', says Jonas Eidevall",
    "description": "Arsenal share Group C with Juventus, Zurich and eight-time champions Lyon; Gunners boss Jonas Eidevall ahead of clash with Lyon on Wednesday evening: \"It's a very good reality check to see where we are at the moment and that is always very exciting to see\"\n\nJonas Eidevall believes Arsenal's upcoming Women's Champions League clash against eight-time champions Lyon will be a \"reality check\" for his side.\n\nArsenal are currently unbeaten in this season's Women's Super League after three matches, having scored nine goals and not conceded any so far in the campaign.\n\nBeth Mead was also on Monday named the runner-up for the women's Ballon d'Or after her impressive performances for club and country in the past year.",
    "image": "https://loremflickr.com/1000/500/sports?random=0.5119102916198854",
    "author": "Nikhil Bhatia",
    "date": "Wed Oct 19 2022 13:31:02 GMT+0200 (Central European Summer Time)"
  },
  {
    "id": "1666179023466",
    "title": "Jurgen Klopp says claims about Man City's spending were not 'xenophobic', while Liverpool make legal complaint",
    "description": "Jurgen Klopp said other clubs could not compete with the spending power of Gulf state-owned Manchester City, Newcastle or PSG; City were reportedly understood to have felt the Liverpool manager's comments inflamed tensions before their fiery clash at Anfield last Sunday\nLiverpool have made a legal complaint against a publication that reported claims from Manchester City that Jurgen Klopp's comments about their spending were \"borderline xenophobic\".\n\nKlopp has strongly refuted the suggestions, which came after he said no other clubs could compete with the financial might of City, Newcastle and Paris Saint-Germain, who are all owned by Gulf",
    "image": "https://loremflickr.com/1000/500/sports?random=0.21458003503942868",
    "author": "Nikhil Bhatia",
    "date": "Wed Oct 19 2022 13:30:23 GMT+0200 (Central European Summer Time)"
  },
  {
    "id": "1666178969833",
    "title": "Darwin Nunez: Why Liverpool's agent of chaos is on the right path at Anfield",
    "description": "While the words, coated with a 'it's funny cause it's true' hue, spoke to the Uruguayan's indecision in possession, it also flagged his largely effective unpredictability. Nunez may not have entirely worked himself out yet - a by-product of trying too hard and overcomplicating simple tasks - but opponents also haven't been able to size him up or shut him down either. Joao Cancelo and Manuel Akanji would be the most recent exhibits. The greatest obstruction the forward has faced is himself - an absence of surety and being in \"a bit of a rush\" per Jurgen Klopp's assessment.\n\n",
    "image": "https://loremflickr.com/1000/500/sports?random=0.4438054307018733",
    "author": "Nikhil Bhatia",
    "date": "Wed Oct 19 2022 13:29:29 GMT+0200 (Central European Summer Time)"
  },
  {
    "id": "1666178924384",
    "title": "Mason Greenwood: Manchester United footballer released on bail after private hearing",
    "description": "The Manchester United footballer, who is charged with attempted rape, assault and controlling and coercive behaviour, was granted bail after the hearing at Minshull Street Crown Court in Manchester Manchester United footballer Mason Greenwood will be released from custody after a bail application was granted. The 21-year-old forward faces charges of attempted rape, controlling and coercive behaviour and assault. He appeared at Manchester Magistrates' Court on Monday and was remanded in custody. A bail application was held in private at Manchester's Minshull Street Crown Court on Wednesday. Following the hearing, a spokesman for the court said bail had been granted, with conditions not to contact witnesses, including the complainant, and to reside at an address on Bow Green Road in Bowdon. Greenwood did not appear for the short hearing but is due to appear at court again on Monday, November 21. All three charges relate to the same woman. The player was first held in January over allegations relating to a young woman after images and videos were posted online. He had been on bail since but was arrested in the Trafford area on Saturday for an alleged breach of conditions. The controlling and coercive behaviour relates to a period between November 2018 and October this year, where he is alleged to have made threatening and derogatory comments towards the complainant, as well as accessing and monitoring her social media accounts. The charge of assault occasioning actual bodily harm is dated December 2021. Within hours of the allegations surfacing online at the beginning of the year, the forward - who has made one appearance for England - was suspended from playing or training with the Old Trafford club. Nike suspended and later terminated its sponsorship deal with Greenwood, while Electronic Arts confirmed his removal from active squads on its Fifa 22 game.\n\n",
    "image": "https://loremflickr.com/1000/500/sports?random=0.5434078079402227",
    "author": "Nikhil Bhatia",
    "date": "Wed Oct 19 2022 13:28:44 GMT+0200 (Central European Summer Time)"
  },
  {
    "id": "1666178879641",
    "title": "Reece Topley: England seamer out of T20 World Cup due to ankle injury",
    "description": "Reece Topley to miss England's T20 World Cup campaign after suffering ankle injury; Tymal Mills and Richard Gleeson are the seamers among England's travelling reserves, with one of them now looking likely to come into the squad; England's first game is against Afghanistan on Saturday\n\n",
    "image": "https://loremflickr.com/1000/500/sports?random=0.6775056035996216",
    "author": "Nikhil Bhatia",
    "date": "Wed Oct 19 2022 13:27:59 GMT+0200 (Central European Summer Time)"
  }
]
